By "group by" refers a process involving one or more of the following steps:

Splitting data into groups based on some criteria
Applying function to each group independently
Combining results into a data structure

By “group by” refers a process involving one or more of the following steps:

#Splitting data into groups based on some criteria.
#Applying function to each group independently.
#Combining results into a data structure.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'M': ['foo', 'bar', 'foo', 'bar'],
                       'N': ['one', 'one', 'two', 'three'],
                       'O': np.random.randn(4),
                       'P': np.random.randn(4)})

In [3]:
df

     M      N         O         P
0  foo    one  1.187323  0.133978
1  bar    one  0.733137 -0.226645
2  foo    two -1.069826  2.616543
3  bar  three -0.326429  1.378670

In [5]:
#Grouping and then applying the sum() function to the resulting groups.
df.groupby('M').sum()

C:\Users\panka\AppData\Local\Temp\ipykernel_7396\3862268797.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('M').sum()

            O         P
M
bar  0.406708  1.152025
foo  0.117497  2.750521

In [6]:
#Grouping by multiple columns forms a hierarchical index, and again we can apply the sum function.
df.groupby(['M','N']).sum()

                  O         P
M   N
bar one    0.733137 -0.226645
    three -0.326429  1.378670
foo one    1.187323  0.133978
    two   -1.069826  2.616543